;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

(package! aggressive-indent)
(package! alert)
(package! company-nixos-options)
(package! company-quickhelp)
(package! company-statistics)
(package! elisp-slime-nav)
(package! evil-lisp-state)
(package! evil-matchit)
(package! evil-smartparens)
(package! flycheck-clojure)
(package! gh-md)
(package! groovy-mode)
(package! mpv)
(package! nginx-mode)
(package! nix-buffer)
;; (package! nix-mode)
(package! nix-sandbox)
(package! nix-update)
(package! nixos-options)
(package! org-bullets)
(package! org-fancy-priorities)
(package! org-pomodoro)
(package! org-present)
(package! org-projectile)
(package! org-ql)
(package! org-super-agenda)
(package! paren-face)
(package! paxedit)
(package! pkgbuild-mode)
(package! rainbow-mode)
(package! swiper)
(package! systemd)
(package! todoist)
(package! whitespace)
(package! yaml-mode)
;; (package! nixpkgs-fmt)
;; (package! sway)
;; (package! webkit-color-picker)
